{"unk_token": "<unk>", "bos_token": "<s>", "eos_token": "</s>", "add_prefix_space": true, "errors": "replace", "sep_token": "</s>", "cls_token": "<s>", "pad_token": "<pad>", "mask_token": "<mask>", "model_max_length": 4096, "special_tokens_map_file": null, "name_or_path": "lingmess-longformer-final-model-dgx02/model", "tokenizer_class": "LongformerTokenizer"}